In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
df = DataFrame({'city':['Alma','Brian Head','Fox Park'],
                'altitude':[3158,3000,2762]})
df

   altitude        city
0      3158        Alma
1      3000  Brian Head
2      2762    Fox Park

In [3]:
#to add a column for each state that a city is in
state_map = {'Alma':'Colorado', 'Brian Head':'Utah', 'Fox Park':'Wyoming'}
df['state'] = df['city'].map(state_map)
df

   altitude        city     state
0      3158        Alma  Colorado
1      3000  Brian Head      Utah
2      2762    Fox Park   Wyoming

# Replace

In [4]:
ser1 = Series([1,2,3,4,1,2,3,4])
ser1

0    1
1    2
2    3
3    4
4    1
5    2
6    3
7    4
dtype: int64

In [5]:
#Using replace we can select which value we want to replace with the new value
ser1.replace(1,np.nan)

0    NaN
1    2.0
2    3.0
3    4.0
4    NaN
5    2.0
6    3.0
7    4.0
dtype: float64

In [6]:
ser1.replace([1,4],[100,400])

0    100
1      2
2      3
3    400
4    100
5      2
6      3
7    400
dtype: int64

In [8]:
ser1.replace({4:np.nan, 3:300})

0      1.0
1      2.0
2    300.0
3      NaN
4      1.0
5      2.0
6    300.0
7      NaN
dtype: float64

# Renaming Indexes

In [9]:
df = DataFrame(np.arange(12).reshape(3,4), 
               index=['NY','LA','SF'],
               columns=['A','B','C','D'])
df

    A  B   C   D
NY  0  1   2   3
LA  4  5   6   7
SF  8  9  10  11

In [11]:
df.index.map(str.lower)

Index(['ny', 'la', 'sf'], dtype='object')

In [13]:
df.index = df.index.map(str.lower)
df

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [14]:
#Rename can be used to create a transformed version
#instead of modifying the original version
df.rename(index=str.title, columns=str.lower)

    a  b   c   d
Ny  0  1   2   3
La  4  5   6   7
Sf  8  9  10  11

In [15]:
df.rename(index={'ny':'NEW YORK'},
          columns={'A':'ALPHA'})

          ALPHA  B   C   D
NEW YORK      0  1   2   3
la            4  5   6   7
sf            8  9  10  11

In [16]:
#To edit DataFrame inplace
df

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [17]:
df.rename(index={'ny':'NEW YORK'}, inplace=True)
df

          A  B   C   D
NEW YORK  0  1   2   3
la        4  5   6   7
sf        8  9  10  11